namespace TelegramBot;
public class ArrDataClass
{
    public static string[] AnswHelloArr = { "Привет,", "Дороу,", "Здравствуйте,", "Приветики,", "Привет-привет," };

    public static string[] AnswWhatsUpArr = { "Дела отлично, только уж очень по тебе соскучился", "Хорошо, приятно, что тебе интересно", "Отлично! Надеюсь, у тебя ещё лучше!",
    "Дела нормально! Ждут, когда я за них возьмусь!","Всё отлично, дружище. Всё просто замечательно!", "Нормально, работаю. А у тебя как?","Отлично. Радуюсь, что ты пришел!" };

    public static string[] WeatherCity = { "Владимир", "Головино", "Москва", "Санкт-Петербург", "Боголюбово", "Гусь-Хрустальный", "Дубай", "Сочи" };

    public static string[] AnswOther = { "Я не знаю как ответить на это 🤔", "Если бы я знал как ответить на это!", "Прости, но я не понял что ты написал😐",
    "Не буду врать и выкручиваться — я не знаю как ответить","Мне очень жаль, но я не знаю, что тебе сказать","Сложновато. Я подумаю над ответом до завтра",
    "Про что это ты?", "Интересно конечно, а что это?"};

    public static string[] SticerArr = { "🙂", "😉", "😁", "😆", "😅", "😀", "🙃", "😇", "😬", "🤑", "🤪", "😋", "🤗", "🙄", "🤥", "😌", "😴", "🤠",
    "🥳","🤖","😽","👽","✋","😎", "👾","👻","😽","😻","❤", "💙","💖","💥","👀"};

    public static string[] AnswWhatAreYouDoArr = { "Учусь разговаривать 🙂, а ты?", "Думаю о тебе, конечно!\U0001F60D", "Планирую захватить мир!", "Болтаю с тараканами в голове!",
    "Наслаждаюсь прекрасным днем!","Планирую ограбить какой-нибудь банк. Ты в деле?","Выполняю миссию не думать о тебе. Это называется: «Миссия невыполнима!» 🥰",
    "Размахиваю мечем Джедая, так что осторожнее!","Мою мыло!","Учу кота разговаривать!","Разрабатываю план по захвату вселенной!"};

    public static string[] CommandArr = { "1⃣  /start - начать общение с ботом заного (возможно добавит что то новое)\n\n2⃣  /command - команда для просмотра доступных комманд\n\n" +
            "3⃣  /getimage - бот скинет одну из нескольких картинок картинок\n\n4⃣  /getsticer - бот скинет рандомный анимированный стикер\n\n" +
            "5⃣  /cityweather - бот покажет доступные города для просмотра погоды\n\n6⃣ /whatwear - бот расскажет что надеть" +
            "\n\n7⃣ /menufortnite - бот скинет доступные функции для игры Fortnite\n\n8⃣ /mapfortnite - бот скинет текущую карту Fortnite" +
            "\n\n9⃣ /shopfortnite - бот скинет магазин игры Fortnite\n\n🔟 /bundlefortnite - бот скинет текущие наборы в магазине Fortnite" +
            "\n\n1⃣1⃣ /newsfortnite - бот скинет новости Fortnite\n\n1⃣2⃣ /otherfeatures - бот скинет список доступных фишек"};

    public static string[] PicArr = { "https://www.animationsource.org/sites_content/lion_king/img_screenshot/85441.jpg", "https://i.playground.ru/p/edomFkDNVvHrgUeiC-kAkw.png",
    "https://nationmagazine.ru/upload/iblock/98f/98fff66db88ff3b85b8b3f3692fb34cc.jpg","https://c.wallhere.com/photos/71/14/1600x1200_px_53_cat_funny_grumpy_humor_meme_quote-1627963.jpg!d",
    "https://favor-pravo.ru/wp-content/uploads/2018/12/oshibka.jpg"};
}
