namespace TelegramBot
{
    public class ArrDataClass
    {
        public static string[] AdminId = { "1733375919", "1443692088" };

        public static string[] HelloArr = { "Привет!", "привет", "Привет", "Ку", "ghbdtn", "ку", "дороу", "Дороу" };

        public static string[] AnswHelloArr = { "Привет,", "Дороу,", "Здравствуйте,", "Приветики,", "Привет-привет," };

        public static string[] WhatsUpArr = { "Как дела?", "как дела?", "как дела", "Как дела" };

        public static string[] AnswWhatsUpArr = { "Дела отлично, только уж очень по тебе соскучился", "Хорошо, приятно, что тебе интересно", "Отлично! Надеюсь, у тебя ещё лучше!",
        "Дела нормально! Ждут, когда я за них возьмусь!","Всё отлично, дружище. Всё просто замечательно!", "Нормально, работаю. А у тебя как?","Отлично. Радуюсь, что ты пришел!" };

        public static string[] WeatherCity = { "Владимир", "Москва", "Санкт-Петербург", "Головино", "Боголюбово", "Дубай", "Гусь-Хрустальный", "Сочи", "Нью-Йорк" };

        public static string[] WhatAreYouDoArr = { "Что делаешь?", "что делаешь?", "Что делаешь", "чд", "Чд", "Чем занимаешься?", "чем занимаешься?", "чем занимаешься", "Чд?" };

        public static string[] AnswSearchArr = { "Что нужно найти?", "Что будем искать?", "Что будем гуглить?", "Что нужно загуглить?" };

        public static string[] AnswSearchYTArr = { "Что нужно найти на ютубе?", "Что будем искать на ютубе?" };

        public static string[] AnswOther = { "Я не знаю как ответить на это 🤔", "Если бы я знал как ответить на это!", "Прости, но я не понял что ты написал😐",
        "Не буду врать и выкручиваться — я не знаю как ответить","Who is it? скажи и я прогуглю","Мне очень жаль, но я не знаю, что тебе сказать","Сложновато. Я подумаю над ответом до завтра",
        "Про что это ты?", "Интересно конечно, а что это?"};

        public static string[] SticerArr = { "🙂", "😉", "😁", "😆", "😅", "😀", "🙃", "😇", "😬", "🤑", "🤪", "😋", "🤗", "🙄", "🤥", "😌", "😴", "🤠",
        "🥳","🤖","😽","👽","✋"};

        public static string[] AnswWhatAreYouDoArr = { "Учусь разговаривать 🙂, а ты?", "Думаю о тебе, конечно!\U0001F60D", "Планирую захватить мир!", "Болтаю с тараканами в голове!",
        "Наслаждаюсь прекрасным днем!","Планирую ограбить какой-нибудь банк. Ты в деле?","Выполняю миссию не думать о тебе. Это называется: «Миссия невыполнима!» 🥰",
        "Размахиваю мечем Джедая, так что осторожнее!","Мою мыло!","Учу кота разговаривать!","Разрабатываю план по захвату вселенной!"};

        public static string[] CommandArr = { "1⃣ /command - команда для просмотра доступных комманд\n\n2⃣ /getimage - бот скинет одну из нескольких картинок картинок\n\n" +
                "3⃣ /start - начать общение с ботом заного (возможно добавит что то новое)\n\n4⃣ /cityWeather - бот покажет доступные города для просмотра погоды\n\n" +
                "5⃣ /request - бот найдет любую информацию в интернете и скинет на нее ссылку в чат\n\n6⃣ /getSticer - бот скинет рандомный стикер" +
                "\n\n7⃣ /whatwear - бот расскажет что надеть"};

        public static string[] CommandArrAdmin = { "\n\n(тестовая функция) /testFunction - бот добавит кнопки некоторых городов вместо клавиатуры [beta]\n\n(тестовая функция) /requestYouTube - бот найдет любое видео на YouTube и скинет ссылку на него [beta]" +
                "\n\n(тестовая функция) /game - бот запустит игру «Угадай число»[beta]" };

        public static string[] PicArr = { "https://www.animationsource.org/sites_content/lion_king/img_screenshot/85441.jpg", "https://i.playground.ru/p/edomFkDNVvHrgUeiC-kAkw.png",
        "https://nationmagazine.ru/upload/iblock/98f/98fff66db88ff3b85b8b3f3692fb34cc.jpg","https://c.wallhere.com/photos/71/14/1600x1200_px_53_cat_funny_grumpy_humor_meme_quote-1627963.jpg!d",
        "https://favor-pravo.ru/wp-content/uploads/2018/12/oshibka.jpg"};
    }
}
